<a href="https://colab.research.google.com/github/pavankumarallu/K_ML/blob/main/BankNifty.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
df1 = pd.read_excel('/content/BankNiftyFutures_Data5Min.xlsx')
df2 = pd.read_excel('/content/BankNiftyFutures_Data5Min.xlsx')

In [4]:
df1.head()

         Ticker       Date  Final Date format  ...     Close 5  Volume 5  Year
0  BANKNIFTY_F1 2015-01-01           20150101  ...  18808.3496     84825  2015
1  BANKNIFTY_F1 2015-01-01           20150101  ...  18829.0000     40925  2015
2  BANKNIFTY_F1 2015-01-01           20150101  ...  18826.0996     27000  2015
3  BANKNIFTY_F1 2015-01-01           20150101  ...  18810.0000     18025  2015
4  BANKNIFTY_F1 2015-01-01           20150101  ...  18803.9492     60100  2015

[5 rows x 10 columns]

In [5]:
df2['Date'] = df2['Date'].astype(str)
df2['Time'] = df2['Time'].astype(str)
df2['new_Time'] = df2['Date']+" "+df2['Time']
df2['new_Time']
df3 = df2

In [6]:
df3

             Ticker        Date  ...  Year             new_Time
0      BANKNIFTY_F1  2015-01-01  ...  2015  2015-01-01 09:20:00
1      BANKNIFTY_F1  2015-01-01  ...  2015  2015-01-01 09:25:00
2      BANKNIFTY_F1  2015-01-01  ...  2015  2015-01-01 09:30:00
3      BANKNIFTY_F1  2015-01-01  ...  2015  2015-01-01 09:35:00
4      BANKNIFTY_F1  2015-01-01  ...  2015  2015-01-01 09:40:00
...             ...         ...  ...   ...                  ...
91732  BANKNIFTY_F1  2019-12-31  ...  2019  2019-12-31 15:06:00
91733  BANKNIFTY_F1  2019-12-31  ...  2019  2019-12-31 15:11:00
91734  BANKNIFTY_F1  2019-12-31  ...  2019  2019-12-31 15:16:00
91735  BANKNIFTY_F1  2019-12-31  ...  2019  2019-12-31 15:21:00
91736  BANKNIFTY_F1  2019-12-31  ...  2019  2019-12-31 15:26:00

[91737 rows x 11 columns]

In [7]:
from datetime import datetime
def converttodate(l):
  dateT = []
  for strdate in l:
    date_time_obj = datetime.strptime(strdate, '%Y-%m-%d %H:%M:%S')
    dateT.append(date_time_obj)

  return dateT


l = df3['new_Time'].values.tolist()
l = converttodate(l)
df3['new_time_2'] = l
df3.head()
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 91737 entries, 0 to 91736
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Ticker             91737 non-null  object
 1   Date               91737 non-null  object
 2   Final Date format  91737 non-null  int64
 3   Time               91737 non-null  object
 4   Open 5             91737 non-null  float64
 5   High 5             91737 non-null  float64
 6   Low 5              91737 non-null  float64
 7   Close 5            91737 non-null  float64
 8   Volume 5           91737 non-null  int64
 9   Year               91737 non-null  int64
 10  new_Time           91737 non-null  object
 11  new_time_2         91737 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(4), int64(3), object(4)
memory usage: 8.4+ MB

In [8]:
df3 = df3.drop(['new_Time'],axis=1)

In [9]:
df4 = df3

In [10]:
df4.head(10)

         Ticker        Date  ...  Year          new_time_2
0  BANKNIFTY_F1  2015-01-01  ...  2015 2015-01-01 09:20:00
1  BANKNIFTY_F1  2015-01-01  ...  2015 2015-01-01 09:25:00
2  BANKNIFTY_F1  2015-01-01  ...  2015 2015-01-01 09:30:00
3  BANKNIFTY_F1  2015-01-01  ...  2015 2015-01-01 09:35:00
4  BANKNIFTY_F1  2015-01-01  ...  2015 2015-01-01 09:40:00
5  BANKNIFTY_F1  2015-01-01  ...  2015 2015-01-01 09:45:00
6  BANKNIFTY_F1  2015-01-01  ...  2015 2015-01-01 09:50:00
7  BANKNIFTY_F1  2015-01-01  ...  2015 2015-01-01 09:55:00
8  BANKNIFTY_F1  2015-01-01  ...  2015 2015-01-01 10:00:00
9  BANKNIFTY_F1  2015-01-01  ...  2015 2015-01-01 10:05:00

[10 rows x 11 columns]

**Resampling the Data to 15 Minute time Frame**

In [11]:
df5 = df4.set_index('new_time_2').resample('15T', closed = 'right').sum()
df6 = pd.DataFrame(df5['Volume 5'])
df5 = df4.set_index('new_time_2').resample('15T', closed = 'right').max()
df6['high 5'] = pd.DataFrame(df5['High 5'])
df5 = df4.set_index('new_time_2').resample('15T', closed = 'right').min()
df6['Low 5'] = pd.DataFrame(df5['Low 5'])
df5 = df4.set_index('new_time_2').resample('15T', closed = 'right').first()
df6['Open 5'] = pd.DataFrame(df5['Open 5'])
df5 = df4.set_index('new_time_2').resample('15T', closed = 'right').last()
df6['Close 5'] = pd.DataFrame(df5['Close 5'])

In [12]:
df7 = df6
df7 = df7.dropna()
df7 = df7.reset_index()

In [ ]:
df7.head(20)

In [ ]:
import plotly.graph_objects as go
fig = go.Figure(data=[go.Candlestick(x=df7['new_time_2'],
                open=df7['Open 5'], high=df7['high 5'],
                low=df7['Low 5'], close=df7['Close 5'])
                     ])

fig.update_layout(xaxis_rangeslider_visible=True)
fig.show()

## **Calculating VWAP**

In [15]:
def calculateVwap(data):
    data['TP'] = (data['high 5']+data['Low 5']+data['Close 5'])/3.0
    data['TradedValue']  = data['TP']*data['Volume 5']
    data['CumVolume'] = data['Volume 5'].cumsum()
    data['CumTradedValue'] = data['TradedValue'].cumsum()
    data['VWAP'] = data['CumTradedValue'] /data['CumVolume']
    return data

In [16]:
df8 = df7

In [17]:
df8 = df8.groupby('new_time_2').apply(calculateVwap)

In [18]:
df8

               new_time_2  Volume 5  ...  CumTradedValue          VWAP
0     2015-01-01 09:15:00    152750  ...    2.876132e+09  18829.016267
1     2015-01-01 09:30:00    104675  ...    1.968794e+09  18808.633467
2     2015-01-01 09:45:00     66825  ...    1.258737e+09  18836.316400
3     2015-01-01 10:00:00     49100  ...    9.251365e+08  18841.883467
4     2015-01-01 10:15:00     16600  ...    3.126699e+08  18835.533200
...                   ...       ...  ...             ...           ...
30718 2019-12-31 14:15:00     96960  ...    3.142921e+09  32414.616533
30719 2019-12-31 14:30:00     56520  ...    1.832874e+09  32428.766267
30720 2019-12-31 14:45:00    114820  ...    3.720061e+09  32399.066400
30721 2019-12-31 15:00:00     95220  ...    3.084060e+09  32388.783200
30722 2019-12-31 15:15:00    259300  ...    8.392037e+09  32364.199867

[30723 rows x 11 columns]

## **Calculate the overall profit and loss**

In [19]:
print("Profit : ",(df8['Close 5'][len(df8)-1]-df8['Open 5'][0]))
print("Profit % : ",str(((df8['Close 5'][len(df8)-1]-df8['Open 5'][0])/df8['Open 5'][0])*100) + " %")

Profit :  13518.550799999997
Profit % :  71.67329531922782 %

## **Resampling the data to Day wise data**

In [20]:
df5 = df4.set_index('new_time_2').resample('1440T', closed = 'right').sum()
df9 = pd.DataFrame(df5['Volume 5'])
df5 = df4.set_index('new_time_2').resample('1440T', closed = 'right').max()
df9['high 5'] = pd.DataFrame(df5['High 5'])
df5 = df4.set_index('new_time_2').resample('1440T', closed = 'right').min()
df9['Low 5'] = pd.DataFrame(df5['Low 5'])
df5 = df4.set_index('new_time_2').resample('1440T', closed = 'right').first()
df9['Open 5'] = pd.DataFrame(df5['Open 5'])
df5 = df4.set_index('new_time_2').resample('1440T', closed = 'right').last()
df9['Close 5'] = pd.DataFrame(df5['Close 5'])

In [21]:
df9.dropna(axis=0,inplace=True)
df9.reset_index(inplace=True)

In [22]:
df9 = df9.groupby('new_time_2').apply(calculateVwap)

In [23]:
df9['Profit/Loss_Values'] = (df9['Close 5'] - df9['Open 5'])

In [24]:
df9

     new_time_2  Volume 5  ...          VWAP  Profit/Loss_Values
0    2015-01-01   1075025  ...  18868.316400             38.6504
1    2015-01-02   2685450  ...  19137.666667            331.1992
2    2015-01-05   2150525  ...  19181.666667            -81.0000
3    2015-01-06   4512350  ...  18712.649733           -646.0000
4    2015-01-07   3834100  ...  18449.116533            -56.6504
...         ...       ...  ...           ...                 ...
1221 2019-12-24   1566820  ...  32320.316400            -36.0508
1222 2019-12-26   2351680  ...  32094.533200           -306.9004
1223 2019-12-27   2483400  ...  32414.416667            613.6504
1224 2019-12-30   2588880  ...  32585.917333            -60.0996
1225 2019-12-31   2321420  ...  32419.766933           -172.0996

[1226 rows x 12 columns]

In [25]:
l = df9['Profit/Loss_Values'].values.tolist()
profit_loss = []
for i in l:
  if i<=0:
    profit_loss.append("Loss")
  else:
    profit_loss.append("Profit")
df9['Profit/Loss'] = profit_loss

In [26]:
df9['Profit/Loss_Percentage'] = ((abs(df9['Close 5'] - df9['Open 5']))/df9['Close 5'])*100

## **Segregate the Profit and Loss day wise**

In [27]:
df9

     new_time_2  Volume 5  ...  Profit/Loss  Profit/Loss_Percentage
0    2015-01-01   1075025  ...       Profit                0.204499
1    2015-01-02   2685450  ...       Profit                1.722215
2    2015-01-05   2150525  ...         Loss                0.422888
3    2015-01-06   4512350  ...         Loss                3.490383
4    2015-01-07   3834100  ...         Loss                0.307059
...         ...       ...  ...          ...                     ...
1221 2019-12-24   1566820  ...         Loss                0.111590
1222 2019-12-26   2351680  ...         Loss                0.959076
1223 2019-12-27   2483400  ...       Profit                1.881613
1224 2019-12-30   2588880  ...         Loss                0.184621
1225 2019-12-31   2321420  ...         Loss                0.531501

[1226 rows x 14 columns]

In [28]:
df9.to_excel("Daily data.xlsx")

# **Resampling to Yearwise data**

In [29]:
df5 = df4.set_index('new_time_2').resample('Y', closed = 'right').sum()
df10 = pd.DataFrame(df5['Volume 5'])
df5 = df4.set_index('new_time_2').resample('Y', closed = 'right').max()
df10['high 5'] = pd.DataFrame(df5['High 5'])
df5 = df4.set_index('new_time_2').resample('Y', closed = 'right').min()
df10['Low 5'] = pd.DataFrame(df5['Low 5'])
df5 = df4.set_index('new_time_2').resample('Y', closed = 'right').first()
df10['Open 5'] = pd.DataFrame(df5['Open 5'])
df5 = df4.set_index('new_time_2').resample('Y', closed = 'right').last()
df10['Close 5'] = pd.DataFrame(df5['Close 5'])

In [30]:
df10 = df10.groupby('new_time_2').apply(calculateVwap)

In [31]:
df10['Profit/Loss_Values'] = (df10['Close 5'] - df10['Open 5'])

In [33]:
l = df10['Profit/Loss_Values'].values.tolist()
profit_loss = []
for i in l:
  if i<=0:
    profit_loss.append("Loss")
  else:
    profit_loss.append("Profit")
df10['Profit/Loss'] = profit_loss

In [34]:
df10.reset_index(inplace=True)

In [35]:
df10['Profit/Loss_Percentage'] = ((abs(df10['Close 5'] - df9['Open 5']))/df10['Close 5'])*100

## **Segregate the Profit and Loss Year wise**

In [36]:
df10

  new_time_2    Volume 5  ...  Profit/Loss  Profit/Loss_Percentage
0 2015-12-31   829540772  ...         Loss               11.483581
1 2016-12-31   806017270  ...       Profit                3.982469
2 2017-12-31   673591560  ...       Profit               24.804535
3 2018-12-31  1516767560  ...       Profit               29.885955
4 2019-12-31  1248437904  ...       Profit               42.847261

[5 rows x 14 columns]

In [37]:
df10.to_excel("Yearly data.xlsx")